# parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
# Generated through utils.kmean_anchors or utils.polygon_kmean_anchors
# [ 27,  26,  20,  40,  44,  19,  34,  34,  25,  47] represents predefined anchors of w1, h1, w2, h2, w3, h3, w4, h4, w5, h5, so total 5 anchors
# there are three anchor layers as follows [27,...,47], [55,...,45], [65,...,122]
anchors:
   - [ 23,  24,  18,  46,  27,  50,  21,  73,  34,  69]
   - [ 19, 122,  33, 102,  37, 150,  54, 109,  24, 263]
   - [ 55, 172,  76, 198,  47, 329, 469,  56,  93, 312]

 
 
 


# [[ 24154, 24173,  20200,  43100,  19857,  64225,  30696,  60006,  20404,  97738]
#  [ 32057, 92971,  23916, 158494,  45520,  98807,  42902, 145928,  88374,  88365]
#  [ 34645,236212,  63892, 180080,  52460, 355126,  85312, 282138, 430952,  58336]]



# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Rotate_Detect, [nc, anchors]],  # Rotate_Detect(P3, P4, P5) [17, 20, 23] represents the layer index
  ]
